nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/
#include "fsl_common.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitBctuTrigSrcPins();
//    BOARD_InitLEDsPins();
    BOARD_InitEMIOS0Pins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

void BOARD_InitEMIOS0Pins(void)
{
  
    // GPIO[123]
    const siul2_pin_settings_t pin_ptd27_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 123u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptd27_config); 
  
  
//    // GPIO[97]
//    const siul2_pin_settings_t pin_ptd1_config =
//    {
//        .base                        = SIUL2,
//        .pinPortIdx                  = 97u,
//        .mux                         = kPORT_MUX_AS_GPIO,
//        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
//        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
//        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
//        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
//        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
//        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
//        .invert                      = kPORT_INVERT_DISABLED,
//        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
//        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
//        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
//        .initValue                   = 1u
//    };
//    SIUL2_PinInit(&pin_ptd1_config);  
          
//    // TRIGERMUX_OUT1
//    const siul2_pin_settings_t pin_ptd0_config =
//    {
//        .base                        = SIUL2,
//        .pinPortIdx                  = 96u,
//        .mux                         = kPORT_MUX_ALT7,
//        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
//        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
//        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
//        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
//        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
//        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
//        .invert                      = kPORT_INVERT_DISABLED,
//        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
//        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
//        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
//        .initValue                   = 1u
//    };
//    SIUL2_PinInit(&pin_ptd0_config);

    
    
    
    
    
    // LCU1_OUT4
    const siul2_pin_settings_t pin_ptb1_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 33u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptb1_config);
    
    // LCU1_OUT5
    const siul2_pin_settings_t pin_ptb0_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 32u,
        .mux                         = kPORT_MUX_ALT5,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptb0_config);
    
    // LCU1_OUT6
    const siul2_pin_settings_t pin_ptc9_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 73u,
        .mux                         = kPORT_MUX_ALT5,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptc9_config);
    
    // LCU1_OUT7
    const siul2_pin_settings_t pin_ptc8_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 72u,
        .mux                         = kPORT_MUX_ALT5,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptc8_config);
        
