nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
    // LCU1_OUT10
    const siul2_pin_settings_t pin_ptc11_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 75u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptc11_config);
            
    // LCU1_OUT11
    const siul2_pin_settings_t pin_ptc10_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 74u,
        .mux                         = kPORT_MUX_ALT6,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptc10_config);
    
    
    
    
    
    
      /* PTD1/eMIOS_0_CH[3]_G-MC_PWM_AT */
    
      /* PTD0/eMIOS_0_CH[2]_G-MC_PWM_AB */
    
//    /* PTE11/eMIOS_0_CH[1]_G-MC_PWM_BT */
//    const siul2_pin_settings_t pin_pte11_config =
//    {
//        .base                        = SIUL2,
//        .pinPortIdx                  = 139u,
//        .mux                         = kPORT_MUX_ALT3,
//        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
//        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
//        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
//        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
//        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
//        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
//        .invert                      = kPORT_INVERT_DISABLED,
//        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
//        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
//        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
//        .initValue                   = 1u
//    };
//    SIUL2_PinInit(&pin_pte11_config);
//    
//    /* PTB16/eMIOS_0_CH[4]_G-MC_PWM_BB */
//    const siul2_pin_settings_t pin_ptb16_config =
//    {
//        .base                        = SIUL2,
//        .pinPortIdx                  = 48u,
//        .mux                         = kPORT_MUX_ALT2,
//        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
//        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
//        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
//        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
//        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
//        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
//        .invert                      = kPORT_INVERT_DISABLED,
//        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
//        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
//        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
//        .initValue                   = 1u
//    };
//    SIUL2_PinInit(&pin_ptb16_config);
//    
//    /* PTB17/eMIOS_0_CH[5]_G-MC_PWM_CT */
//    const siul2_pin_settings_t pin_ptb17_config =
//    {
//        .base                        = SIUL2,
//        .pinPortIdx                  = 49u,
//        .mux                         = kPORT_MUX_ALT2,
//        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
//        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
//        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
//        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
//        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
//        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
//        .invert                      = kPORT_INVERT_DISABLED,
//        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
//        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
//        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
//        .initValue                   = 1u
//    };
//    SIUL2_PinInit(&pin_ptb17_config);
//    
//    /* PTA17/eMIOS_0_CH[6]_G-MC_PWM_CB */
//    const siul2_pin_settings_t pin_pta17_config =
//    {
//        .base                        = SIUL2,
//        .pinPortIdx                  = 17u,
//        .mux                         = kPORT_MUX_ALT2,
//        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
//        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
//        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
//        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
//        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
//        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
//        .invert                      = kPORT_INVERT_DISABLED,
//        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
//        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
//        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
//        .initValue                   = 1u
//    };
//    SIUL2_PinInit(&pin_pta17_config);
    
