nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void)
{
   const siul2_pin_settings_t pin_pte3_config =
   {
        .base                        = SIUL2,
        .pinPortIdx                  = 131u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .inputMuxReg                 = {
                                         192u
                                       },
        .inputMux                    = {
                                         kPORT_INPUT_MUX_ALT1,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },
        .initValue                   = 2u
    };
   SIUL2_PinInit(&pin_pte3_config);


   const siul2_pin_settings_t pin_pte14_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 142u,
        .mux                         = kPORT_MUX_ALT4,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u
    };
    SIUL2_PinInit(&pin_pte14_config);
}

void BOARD_InitLEDsPins(void)
{
    /* Red LED. */
    const siul2_pin_settings_t pin_ptc16_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 80u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .slewRateCtrlSel             = kPORT_SLEW_RATE_SLOWEST,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptc16_config);

    const siul2_pin_settings_t pin_ptc14_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 78u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptc14_config);

    const siul2_pin_settings_t pin_ptb22_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 54u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .driveStrength               = kPORT_DRIVE_STRENTGTH_DISABLED,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 1u
    };
    SIUL2_PinInit(&pin_ptb22_config);
}

void BOARD_InitBUTTONsPins(void)
{
    /* SW5 */
    const  siul2_pin_settings_t pin_ptb26_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 58u,
        .mux                         = kPORT_MUX_AS_GPIO,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,

