nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
    SIUL2_PinInit(&pin_ptd23_config);

    const  siul2_pin_settings_t pin_ptd24_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 120u,
        .mux                         = kPORT_MUX_ALT3,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_ENABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_ptd24_config);

    const  siul2_pin_settings_t pin_ptd26_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 122u,
        .mux                         = kPORT_MUX_ALT5,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_ENABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_ptd26_config);

    const  siul2_pin_settings_t pin_ptd27_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 123u,
        .mux                         = kPORT_MUX_ALT5,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_ENABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_ptd27_config);
}

void BOARD_InitLpcmpPins(void)
{
    const  siul2_pin_settings_t pin_pta0_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 0u,
        .mux                         = kPORT_MUX_ALT1,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,

        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_pta0_config);

    const  siul2_pin_settings_t pin_pta1_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 1u,
        .mux                         = kPORT_MUX_ALT1,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,

        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_pta1_config);

    const  siul2_pin_settings_t pin_pta2_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 2u,
        .mux                         = kPORT_MUX_ALT1,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,

        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_pta2_config);
}

void BOARD_InitBctuTrigSrcPins(void)
{
//    const  siul2_pin_settings_t pin_pte11_config =
//    {
//        .base                        = SIUL2,
//        .pinPortIdx                  = 139u,
//        .mux                         = kPORT_MUX_ALT3,
//        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
//        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
//        .driveStrength               = kPORT_DRIVE_STRENTGTH_ENABLED,
//        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
//        .slewRateCtrlSel             = kPORT_SLEW_RATE_FASTEST,
//        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
//        .invert                      = kPORT_INVERT_DISABLED,
//        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
//        .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,
//        .initValue                   = 0u
//    };
//
//    SIUL2_PinInit(&pin_pte11_config);
}

void BOARD_InitFLASHPins(void)
{
    const  siul2_pin_settings_t pin_ptd10_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 106u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .inputMuxReg                 = {
                                         309u
                                       },
        .inputMux                    = {
                                         kPORT_INPUT_MUX_ALT1,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },

        .initValue                   = 1u,
    };

    SIUL2_PinInit(&pin_ptd10_config);

    const  siul2_pin_settings_t pin_ptc3_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 67u,
        .mux                         = kPORT_MUX_ALT6,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,

