nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_ptc3_config);

    const  siul2_pin_settings_t pin_ptd11_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 107u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .inputMuxReg                 = {
                                         305u
                                       },
        .inputMux                    = {
                                         kPORT_INPUT_MUX_ALT1,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },

        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_ptd11_config);

    const  siul2_pin_settings_t pin_ptd7_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 103u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .inputMuxReg                 = {
                                         306u
                                       },
        .inputMux                    = {
                                         kPORT_INPUT_MUX_ALT1,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },

        .initValue                   = 2u,
    };

    SIUL2_PinInit(&pin_ptd7_config);

    const  siul2_pin_settings_t pin_ptd12_config =
    {
        .base                        = SIUL2,
        .pinPortIdx                  = 108u,
        .mux                         = kPORT_MUX_ALT7,
        .safeMode                    = kPORT_SAFE_MODE_DISABLED,
        .inputFilter                 = kPORT_INPUT_FILTER_NOT_AVAILABLE,
        .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
        .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
        .invert                      = kPORT_INVERT_DISABLED,
        .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
        .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
        .inputMuxReg                 = {
                                         307u
                                       },
        .inputMux                    = {
                                         kPORT_INPUT_MUX_ALT1,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT,
                                         kPORT_INPUT_MUX_NO_INIT
                                       },

